import java.util.*;
public class 반복문_반복제어문_문제 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
//		// 5.  두 개의 주사위를 던졌을 때, 눈의 합이 6이 되는 모든 경우의 수를 
//	    출력하는 프로그램을 작성하시오.
		
//		for(int i=1;i<=6;i++)
//		{
//			for(int j=1;j<=6;j++)
//			{
//				if(i+j==6)
//				{
//					System.out.println("["+i+","+j+"]");
//				}
//			}
//		}
		
//	    // 6. 사용자로부터 두개의 정수(시작,끝)를 입력받아 시작(포함)해서 
//	       끝(포함)까지의 곱을 출력하는 프로그램을 작성하시오.
		
		
		
//	    // 7.  5~16까지의 합을 구하시오
		
		
//	    // 8. 3이상 4462 이하에서 짝수인 정수의 합을 구하여라.
		
		
		
//	    // 9. 0~12까지 2의 배수, 3의 배수의 합을 구하여라.
		
//	    // 10. 1~100까지의 정수 중 4의 배수의 합계를 구하라
		
//	    // 11. 10개의 정수를 입력받아 그 수들 중 짝수의 개수가 몇개인지 출력하는 프로그램 작성
			
		
		
//	    // 12. 10개의 정수를 입력받아 3의 배수의 개수와 5의 배수의 개수를 각각 출력하는 프로그램
		
		
		
//	    // 13. 다음 결과를 출력하는 프로그램
//		출력예) ********** (5행10열)
//           	  **********
//		      **********            
//		      **********           
//		      **********

		
		
//	    // 14. 다음 결과를 출력하는 프로그램
		// 11111
		// 22222
		// 33333
		// 44444
		// 55555
		

//	    // 15. 다음 결과를 출력하는 프로그램
		// 1####
		// #2###
		// ##3##
		// ###4#
		// ####5
		
		
//	    // 16. 다음 결과를 출력하는 프로그램
		// ABCDE
		// ABCDE
		// ABCDE
		// ABCDE
		// ABCDE
		
		
//	    // 17. 다음 결과를 출력하는 프로그램
		// AAAAA
		// BBBBB
		// CCCCC
		// DDDDD
		// EEEEE
		
		
	}

}
