import java.util.Arrays;

public class 문자열배열_문제 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
//		1. (1차배열)1번 학생 100점 2번 학생 90점 3번학생 85점이다.
//		 점수를 score 배열 변수에 저장하고 1) 아래와 같이 출력하시오.
//		1번 학생 : 100점  
//		2번 학생 : 90점  
//		3번 학생 : 85점  
//		2) 학생들의 총점을 출력하시오.

		
//		2. 1월달 사원(1번부터 5번사원)의 실적이 50 45 35 12 70 이다. (실적 0~100)
//		1) 사번별 실적을 출력하시오. 사원(1) 50
//		2) 1월 실적의 총점과 평균을 출력하시오.
//		3) 실적이 제일 큰 사원의 사번과 실적, 작은 사원의 사번과 실적을 출력하시오.
		
	}

}
